{
  "intro": "Welcome to Our Forever. We're so grateful you're here to celebrate love, laughter, and the beginning of our greatest adventure yet. What started with a simple hello turned into the best decision of our lives. This is our love story - a little modern, a little traditional, and completely God-orchestrated.",
  "timeline": [
    {
      "title": "How We Met",
      "date": "Online to Long-Distance",
      "body": "Our story started the modern way. Online. One message became daily conversations. Those conversations turned into a real friendship. For four months, we just talked. No pressure. No labels. Just two people genuinely enjoying each other's company. And yes, it was long-distance. Which meant FaceTime dates, countdowns to visits, airport hugs, and 'text me when you land' every single time. Somewhere between the time zones and travel plans, we realized this was no longer just friendship. It was something deeper. So we chose each other, intentionally.",
      "image": "/images/couple/How-we-met.png"
    },
    {
      "title": "When We Knew",
      "date": "First In-Person Meeting",
      "body": "The first time we met in person, everything clicked. It felt easy. Peaceful. Familiar. There was no forcing it, no overthinking. Just clarity. It felt like meeting someone we had already known for a long time. That was the moment we both knew this was different.",
      "image": "/images/couple/couplepic3.jpeg"
    },
    {
      "title": "The Proposal",
      "date": "On Vacation",
      "body": "During one of our vacations, we spent an evening on a rooftop overlooking the city skyline. The lights were glowing beneath us, and the moment felt calm and beautiful. What started as a simple night out became one of the most meaningful moments of our lives. A question was asked. A yes was given. And our forever officially began.",
      "image": "/images/couple/wedding-bands.png"
    },
    {
      "title": "What We're Most Excited About",
      "date": "Looking Ahead",
      "body": "We're excited for the celebration, the music, the outfits, and seeing everyone we love in one place. But more than anything, we're excited about the life ahead. Building a home. Growing together. Supporting each other's dreams. Choosing each other every single day. The wedding is a beautiful moment. The marriage is the real journey.",
      "image": "/images/couple/couplepic1.png"
    },
    {
      "title": "A Note to Our Guests",
      "date": "From Our Hearts",
      "body": "To our family and friends, thank you for loving us, praying for us, encouraging us, and standing by us. Some of you watched us grow individually. Some of you watched this relationship grow. All of you have played a part in our story. Having you here means more than we can put into words. We cannot wait to celebrate with you.",
      "image": "/images/couple/quote-we-love.png"
    },
    {
      "title": "Our Foundation",
      "date": "Faith and Tradition",
      "body": "Our love may have started online, but it is grounded in faith and strengthened by tradition. We believe marriage is sacred. It is a covenant before God and a union of two families. We step into this chapter with gratitude, humility, and joy. Two hearts. Two families. One blessed union.",
      "image": "/images/church/church2.jpg"
    },
    {
      "title": "A Quote We Love",
      "date": "Song of Solomon 3:4",
      "body": "I have found the one whom my soul loves. And simply put: From long distance to one forever home.",
      "image": "/images/couple/fixed.png"
    }
  ]
}
